# 3. Задайте список из n чисел последовательности (1 + 1/n)^n и выведите на экран их сумму.
    
#     *Пример:*
    
#     - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19}
    
n = int(input('Введите число n: '))
for i in range(1, n+1):
    new_num = (i+1/i)**i
    print(f'{i}: {new_num}')

